Tekla Open API Reference for Tekla Structures 2025
IntegerConverter.ConvertFrom Method
 Converts an object from the given culture to the Tekla.Structures.Datatype.Integer type.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override Object ConvertFrom(
	ITypeDescriptorContext context,
	CultureInfo culture,
	Object value
)
Public Overrides Function ConvertFrom (
	context As ITypeDescriptorContext,
	culture As CultureInfo,
	value As Object
) As Object
Parameters
context
Type: System.ComponentModel.ITypeDescriptorContext
The context.
culture
Type: System.Globalization.CultureInfo
The culture.
value
Type: System.Object
The object to be converted.
Return Value
Type: Object
The new integer datatype object.
See Also
Reference
IntegerConverter Class
Tekla.Structures.Datatype Namespace